#+TITLE: ACM Tech Stack
#+DESCRIPTION: Moving all of ACM's services to cloud providers is going to be a tough one.

This repository includes all the files necessary to describe and deploy the
technology stack of ACM @ UCSD. You will find files such as:

- Ansible roles and playbooks
- Terraform files
- Custom patches and images for certain services

* Provisioning
Speaking with Aaron Eason about the system specifications of his previous instances
for each service, we know that:
- ACM Live requires 16 GB of RAM and 4 vCPU cores.
- The Minecraft server requires 8 GB of RAM.

The other services most likely require a maximum of 1 GB of RAM.[fn:current-stack-requirements]

In order to maintain uptime for all components of the stack, each
service will run on a separate instance of appropriate size.

As of now, AWS takes too much of a cost for all of the services above; therefore,
we'll split the cost between Azure and AWS.

Additionally, each service will be provisioned with separate Ansible
playbooks.

We'll begin with the easiest instances to plan, which are those for
small services; BreadBot and Password Manager.

#+BEGIN_SRC terraform :tangle instances.tf
provider "aws" {
  region = "us-west-1"
}

# Ubuntu 20.04 LTS instance, for good measure
# Find other AMI's at https://cloud-images.ubuntu.com/locator/ec2/
resource "aws_instance" "breadbot" {
  ami           = "ami-0cd230f950c3de5d8"
  instance_type = "t3a.nano"
  tags {
    Name = "BreadBot"
  }
}

resource "aws_instance" "pass" {
  ami           = "ami-0cd230f950c3de5d8"
  instance_type = "t3a.nano"
  tags {
    Name = "Password Manager"
  }
}
#+END_SRC

ACM Live requires a more demanding server. Particularly, =t3= instances
shouldn't be used due to their potential CPU throttling on a server
with constant workload. We can use =m5= instances:

#+BEGIN_SRC terraform :tangle instances.tf
# ACM Live runs on Ubuntu 16.04 LTS
# We'll use a HVM instance of it, no extra stuff on top.
resource "aws_instance" "live" {
  ami           = "ami-0a63cd87767e10ed4"
  instance_type = "m5a.large"
  tags {
    Name = "ACM Live"
  }
}
#+END_SRC

Minecraft also runs on a beefy instance; we'll keep it simple with
an Ubuntu image, though:
#+BEGIN_SRC terraform :tangle instances.tf
resource "aws_instance" "minecraft" {
  ami           = "ami-0cd230f950c3de5d8"
  instance_type = "t3a.medium"
  tags {
    Name = "Minecraft Server"
  }
}
#+END_SRC

We will also include instances for the membership portal; we will need
one for the API, and we'll use AWS' RDS in order to host the PostgreSQL
database:

#+BEGIN_SRC terraform :tangle instances.tf
resource "aws_instance" "membership-portal" {
  ami           = "ami-0a63cd87767e10ed4"
  instance_type = "t3a.micro"
  tags {
    Name = "Membership Portal API"
  }
}

resource "aws_db_instance" "membership-portal-db" {
  allocated_storage = 10
  engine            = "postgres"
  instance_class    = "db.t3.micro"
  name              = var.dbName
  username          = var.dbUser
  password          = var.dbPass
}
#+END_SRC

Note the above variables used originate using the provided =.env= file. Edit
its contents with values of your choice. The playbooks will also use them
to properly deploy =.env= files.

Using the [[https://calculator.aws][AWS Calculator]], we obtain the cost for all the instances per year:
| Instance            | Instance Type | Cost Per Month |
|---------------------+---------------+----------------|
| BreadBot            | t3a.nano      |           5.29 |
| Pass                | t3a.nano      |           5.29 |
| ACM Live            | m5a.large     |          85.73 |
| Minecraft           | t3a.medium    |          34.96 |
| Portal API          | t3a.micro     |           9.38 |
| Portal Database     | db.t3.micro   |          16.55 |
|---------------------+---------------+----------------|
| Total Cost / Month: |               |          157.2 |
| Total Cost / Year:  |               |         1886.4 |
|---------------------+---------------+----------------|
#+TBLFM: @8$3=vsum(@I..@II)::@9$3=vsum(@I..@II)*12

Assuming all goes well, running Terraform will deploy the stack.
#+BEGIN_SRC sh
terraform init && terraform apply
#+END_SRC

We will now begin deploying the software for each service.
We'll document the SSH commands used in tandem with the respective Ansible task
and role.

[fn:current-stack-requirements] Funnily enough, this is hard to quantify properly. Pass and BreadBot both occupied the GCP =f1.micro=, which has 0.6 GB of RAM, so maybe a bit more is useful. The API, however, is up for discussion, considering Heroku's less obvious nature with system requirements.

* Password Manager

The password manager is, in essence, a =bitwarden_rs= instance deployed on top
of a Bitwarden image. We will use the =pass= Ansible host for all the following
commands once we start building the playbook.

The easiest way, by far, to install =bitwarden_rs= is to use the Docker Compose tutorial
provided by the [[https://github.com/dani-garcia/bitwarden_rs/wiki/Using-Docker-Compose][bitwarden_rs wiki]].

First, configure the remote machine to be able to connect to it using your SSH
keys. Either [[https://www.ssh.com/ssh/keygen/][create a new one]] or provide the public key. If developing using a
Vagrant box, use this command to import the =pass= settings to your
configuration:

#+BEGIN_SRC sh
vagrant ssh-config --host pass >> $HOME/.ssh/config
#+END_SRC

You can also set these parameters manually in your SSH configuration file for
the Terraform-provisioned instances.[fn:ssh-terraform]

First, we'll want to install Docker by following the [[https://docs.docker.com/engine/install/ubuntu/][installation guide]] for Ubuntu:
#+BEGIN_SRC sh :dir /ssh:pass|sudo:pass:~/ :results drawer
sudo apt-get update
sudo apt-get install -y \
    apt-transport-https \
    ca-certificates \
    curl \
    gnupg-agent \
    software-properties-common
curl -fsSL https://download.docker.com/linux/ubuntu/gpg | sudo apt-key add -
sudo add-apt-repository \
   "deb [arch=amd64] https://download.docker.com/linux/ubuntu \
   $(lsb_release -cs) \
   stable"
sudo apt-get update
sudo apt-get install -y docker-ce docker-ce-cli containerd.io
#+END_SRC

Similarly for Docker Compose, using this [[https://docs.docker.com/compose/install/][installation guide]]:

#+BEGIN_SRC sh :dir /ssh:pass|sudo:pass:~/
sudo curl -L "https://github.com/docker/compose/releases/download/1.26.2/docker-compose-$(uname -s)-$(uname -m)" -o /usr/local/bin/docker-compose
sudo chmod +x /usr/local/bin/docker-compose
sudo ln -s /usr/local/bin/docker-compose /usr/bin/docker-compose
docker-compose --version
#+END_SRC

#+RESULTS:
| docker-compose version 1.26.2 | build eefe0d31 |

Second, we'll need to copy over the Docker Compose file for the =pass= instance, provided
in the repo, along with the environment variables for it:

#+BEGIN_SRC sh
scp ./roles/pass/files/docker-compose.yml pass:~/
scp ./roles/pass/files/.env pass:~/
scp ./roles/pass/files/Caddyfile pass:~/
#+END_SRC

Afterwards, we'll want to log into the pass instance and create the directory used
by =bitwarden_rs= in the same directory.

#+BEGIN_SRC sh :dir /ssh:pass:~/
mkdir ~/bw-data
#+END_SRC

Afterwards, all we have to do is spin up the Docker Compose service.

#+BEGIN_SRC sh :dir /ssh:pass|sudo:pass:~/ :results drawer
sudo docker-compose up -d
#+END_SRC

The Ansible role =pass= covers the installation process of the password manager
for a brand new Ubuntu instance. You will also need to deploy the =gerlingguy.docker=
role for the instance.
Run the =pass.yml= playbook to configure the password manager:

#+BEGIN_SRC sh :results drawer
ansible-playbook -i production pass.yml
#+END_SRC

Up next, we will configure BreadBot.

[fn:ssh-terraform] In reality, this is not probably necessary; AWS/Azure will likely configure
SSH keys for likely accounts in the instances, but that will require some Terraform configuration;
good task for later.

